In [2]:
import pandas as pd

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

![png](BOOKS_ERD.png)

In [5]:
# Create connection string using credentials following this format
#connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/books"

In [7]:
engine = create_engine(connection)

In [8]:
#Create database
create_database(connection)

In [9]:
#Verify the database
database_exists(connection)

True

In [11]:
# load the files as dataframe and then add to database 
Users=pd.read_csv('Users.csv')
Users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [13]:
Users.to_sql('users', engine, if_exists = 'replace')

3

In [14]:
Books=pd.read_csv('Books.csv')
Books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [15]:
Books.to_sql('books', engine, if_exists = 'replace')

6

In [16]:
Authors=pd.read_csv('Authors.csv')
Authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [17]:
Authors.to_sql('authors', engine, if_exists = 'replace')

5

In [18]:
Favorites=pd.read_csv('Favorites.csv')
Favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [19]:
Favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [20]:
q = """SHOW TABLES"""

pd.read_sql(q,engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [21]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1